Repository: VRK-YTI/yti-datamodel-ui
Catalog: po/*.po
Languages: sv

source: Class attribute id info
sv: Sekundär identifikationsuppgift för klassens attribut som kan användas i ett schema eller andra lokala genomföranden

source: Class association id
sv: Lokal identifikationsuppgift för klassens association

source: Class association id info
sv: Sekundär identifikationsuppgift för klassens association som kan användas i ett schema eller andra lokala genomföranden

source: Concept id
sv: Begreppets identifikationsuppgift

source: Concept id info
sv: Begreppets unika URI-identifikationsuppgift

source: Vocabulary id
sv: Ordlistans identifikationsuppgift

source: Vocabulary id info
sv: Kort identifikationsuppgift för ordlistan

source: Reference data URI
sv: Kodlistans URI

source: Reference data URI info
sv: Kodlistans URI-kod är en permanent och unik referens till kodlistans läge

source: Max properties
sv: Maxantal egenskaper

source: Max properties info
sv: Maxantal attribut eller associationer för klassen. OBS! Fungerar endast i JSON-scheman.

source: Min properties
sv: Minimiantal egenskaper

source: Min properties info
sv: Minimiantal attribut eller associationer för klassen. OBS! Fungerar endast i JSON-scheman.

source: Group label
sv: Gruppens namn

source: Group label info
sv: Namn för områdets grupp

source: Class label
sv: Klassens namn

source: Class label info
sv: Klassens människoläsbara namn

source: Shape label
sv: Den preciserade klassens namn

source: Shape label info
sv: Den preciserade klassens människoläsbara namn

source: Property label
sv: Egenskapens namn

source: Property label info
sv: Egenskapens människoläsbara namn

source: Class property label
sv: Namn för klassens egenskap

source: Class property label info
sv: Människoläsbart namn för klassens egenskap

source: Class attribute label
sv: Namn för klassens attribut

source: Class attribute label info
sv: Människoläsbart namn för klassens attribut

source: Class association label
sv: Namn för klassen association

source: Class association label info
sv: Människoläsbart namn för klassens association

source: Concept suggestion label
sv: Begreppsförslagets namn

source: Concept suggestion label info
sv: Föreslagen term för begreppet

source: Concept definition
sv: Begreppets definition

source: Concept definition info
sv: Begreppets definition beskriver begreppets innehåll på allmän nivå och tar endast i beaktande väsentliga begreppsdrag

source: Concept suggestion definition
sv: Begreppsförslagets definition

source: Concept suggestion definition info
sv: Begreppsförslagets definition bör omfatta bakgrundinformation om hur begreppets används eller vara välformulerad. En välformulerad definition beskriver objektets semantiska innehåll exakt och tar endast i beaktande objektets nödvändiga drag, men dock i tillräcklig utsträckning.

source: Namespace label
sv: Namnrymdens namn

source: Namespace label info
sv: Människoläsbart namn för namnrymden

source: Reference data label
sv: Kodlistans namn

source: Reference data label info
sv: En kodlista är en överenskommen grupp kodvärden

source: State
sv: Status

source: State info
sv: Status för resursen gällande en förvaltningsmodell

source: Defined by
sv: Definition

source: Defined by info
sv: Referens till modell som definierar resursen

source: Defined by library
sv: Datakomponetbibliotek

source: Defined by library info
sv: Referens till datakomponentbibliotek där resursen är definierad

source: Defined by profile
sv: Definierad i tillämpningsprofil

source: Defined by profile info
sv: Referens till tillämpningsprofil där användningen av resursen är definierad

source: Superclass
sv: Överordnad klass

source: Superclass info
sv: Klass som kan generaliseras och som har en bredare semantik

source: Superassociation
sv: Överordnad association

source: Superassociation info
sv: Association som kan generaliseras och som har en bredare semantik

source: Superattribute
sv: Överordnat attribut

source: Superattribute info
sv: Attribut som kan generaliseras och som har en bredare semantik

source: Superproperty
sv: Överordnat begrepp

source: Superproperty info
sv: Egenskap som kan generaliseras och som har en bredare semantik

source: Range
sv: Datatyp

source: Range info
sv: Attributets datatyp ska väljas bland kompatibla XSD-datatyper

source: Specialized from class
sv: Preciserad utifrån klass

source: Specialized from class info
sv: Klass som har preciserats i tillämpningsprofilen

source: Example
sv: Exempel

source: Definition info
sv: Begreppets definition

source: Value class
sv: Objekt

source: Value class info
sv: Referens till klass oms fungerar som objekt för associationen

source: Predicate type
sv: Egenskapens typ

source: Predicate type info
sv: Egenskapen kan vara antingen ett attribut eller en association

source: Equivalent class
sv: Motsvarande klasser

source: Equivalent class info
sv: En förteckning över klasser som definierats på andra ställen och som har motsvarande semantisk betydelse

source: Equivalent attribute
sv: Motsvarande attribut

source: Equivalent attribute info
sv: En förteckning över attribut som definierats på andra ställen och som har motsvarande semantisk betydelse

source: Equivalent association
sv: Motsvarande associationer

source: Equivalent association info
sv: En förteckning över associationer som definierats på andra ställen och som har motsvarande semantisk betydelse

source: Equivalent property
sv: Motsvarande egenskaper

source: Equivalent property info
sv: En förteckning över egenskaper som definierats på andra ställen och som har motsvarande semantisk betydelse

source: Broader concept
sv: Bredare begrepp

source: Broader concept info
sv: Överordnat begrepp som anknyter till begreppet

source: Internal group page
sv: Gruppens interna sidor

source: Internal group page info
sv: Interna sidor för gruppen i området i fråga

source: Vocabulary info
sv: Information om ordlistan

source: Namespace
sv: Namnrymd

source: Namespace info
sv: Namnrymden som används för att individualisera och resolvera resurser

source: Previous version
sv: Tidigare version

source: Previous version info
sv: Länk till den tidigare versionen

source: Resource identifier
sv: Resursens identifikationsuppgift

source: Resource identifier info
sv: Använd attributets värde som resursens huvudsakliga identifikationsuppgift

source: Default value
sv: Standardvärde

source: Default value info
sv: Standardvärde som ges en egenskap om inget annat värde har fastställts

source: Allowed values
sv: Tillåtna värden

source: Allowed values info
sv: Lista över tillåtna värden för egenskapen

source: Class type
sv: Klassens typ

source: Class type info
sv: En klass kan ha flera tillåtna klassdefinitioner

source: Fixed value
sv: Obligatoriskt värde

source: Fixed value info
sv: Obligatoriskt värde som fastställts på förhand och som ska finnas i datamängden

source: Pattern
sv: Regelbunden mening

source: Pattern info
sv: Regelbunden mening som kan användas för att validera egenskapens värden

source: Min count
sv: Minimiantal

source: Min count info
sv: Minimiantal tillåtna värden

source: Max count
sv: Maxantal

source: Max count info
sv: Maxantal tillåtna värden

source: Min length
sv: Minimilängd

source: Min length info
sv: Värdets minsta tillåtna längd

source: Max length
sv: Maxlängd

source: Max length info
sv: Värdets högsta tillåtna antal

source: XML Wrapper info
sv: Bilda ett XML Wrapper-element av identifikationsuppgiften för klassens egenskap

source: XML Attribute
sv: XML-attribut

source: XML Attribute info
sv: Bilda av egenskapen ett attribut för XML-elementet i ett XML-schema

source: Deactivated
sv: Inaktiverad

source: Deactivated info
sv: En inaktiverad resurs används inte för att generera eller validera scheman

source: Unique label info
sv: Definiera om endast ett lokaliserat värde är tillåtet per språk. Med hjälp av detta kan man fastställa exempelvis ”Maxantal 2” så att endast värden i olika språk är tillåtna.

source: Equals
sv: Lika med

source: Equals info
sv: Egenskap med ett värde som ska vara lika med värdet för denna egenskap

source: Disjoint
sv: Annan än

source: Disjoint info
sv: Egenskap som ska ha ett annat värde än värdet för denna egenskap

source: Less than
sv: Mindre än

source: Less than info
sv: Egenskap som ska ha ett annat värde än värdet för denna egenskap

source: Less than or equals
sv: Mindre än eller lika med

source: Less than or equals info
sv: Egenskap med ett värde som ska vara mindre än eller lika med värdet för denna egenskap

source: Homepage
sv: Länk

source: Homepage info
sv: Länk till en webbplats eller en applikation där det informerande innehållet används

source: Title info
sv: Människoläsbart namn

source: External URI
sv: Extern identifikationsuppgift

source: External URI info
sv: Referens till en extern URI-kod

source: Namespace redirection
sv: Omdirigering av namnrymd

source: Namespace redirection info
sv: Genom att omdirigera namnrymden kan man definiera informationsmodeller som använder en extern namnrymd

source: Constraint classes
sv: Klasser för en logisk begränsning

source: Root class
sv: Rotnod

source: Root class info
sv: En rotnod används för att definiera utgångspunkten för en hierarkisk informationsmodell, till exempel den första entiteten i ett XML- eller JSON-meddelande

source: Creator
sv: Skapad av

source: Localname
sv: Klassens lokala identifikationsuppgift

source: Localname info
sv: Kan användas i scheman eller andra lokala genomföranden

source: Read-only
sv: Endast ett tal

source: Read-only info
sv: Ett attribut vars värde inte längre får redigeras efter den första formateringen

source: API path
sv: API-sökväg

source: API path info
sv: En API-sökväg ska definieras för minst en klass så att Open API-beskrivningen kan göras på rätt sätt. För API-sökvägen kan användas sökvägs- ({}) eller frågeparametrar (?&), till exempel: /org/{id}/person?name&role

source: Contact label
sv: Kontakt

source: Contact label info
sv: Responskanal för informationsmodellen, t.ex. e-postadress.

source: owl:DatatypeProperty
sv: Attribut

source: owl:ObjectProperty
sv: Association
