Repository: VRK-YTI/yti-datamodel-ui
Catalog: po/*.po
Languages: sv

source: Select name and description info
sv: Önskade egenskaper väljs bland egenskaper

source: Select new association creation
sv: Välj skapa ny association

source: Select new association creation info
sv: Skapa en ny association om du inte hittar återanvändbara egenskaper

source: Select new attribute creation
sv: Välj lägg till nytt attribut

source: Select new attribute creation info
sv: Här kan du skapa ett nytt attribut

source: Select new creation
sv: Välj skapa ny

source: Select new creation info
sv: Skapa ny om du inte hittar befintliga datadefinitioner

source: Select registration number and vehicle code
sv: Välj registreringsnummer och fordonsnummer

source: Select registration number and vehicle code info
sv: Här kan du välja egenskaper för den överordnade klassen som du vill använda

source: Select search result
sv: Välj {{name}}

source: Select search result info
sv: Välj rätt värde i listan

source: Select super class
sv: Välj överordnad klass

source: Select the vocabulary that is missing the required concept
sv: Välj en ordlista, i vilken du vill föreslå ett nytt begrepp

source: Suggest definition or description for the concept
sv: Föreslå en definition för begreppet genom att beskriva begreppet som noggrant som möjligt

source: Super class can be changed from the list or by typing the identifier
sv: Du kan byta överordnad klass via knappen eller genom att ange klassens kod

source: Super class is here
sv: Den överordnade klassen visas här

source: Super class must be selected from list of existing classes
sv: Den överordnade klassen måste väljas bland befintliga klasser

source: This tutorial shows how to add Class from existing library
sv: Denna anvisning visar hur man hänvisar från till en befintlig klass från ett annat bibliotek

source: This tutorial shows how to add association to a Class
sv: Denna anvisning visar hur man lägger till en ny association till en klass

source: This tutorial shows how to add new attribute
sv: Denna anvisning visar hur man lägger till ett nytt attribut till en klass

source: This tutorial shows how to create a new Class
sv: Denna anvisning visar hur man lägger till en ny klass

source: This tutorial shows how to create a new shape from a class
sv: Denna anvisning visar hur man preciserar en klass utifrån en befintlig klass

source: This tutorial shows how to import new namespace to the model
sv: Denna anvisning visar hur man lägger till en namnrymd

source: Vocabularies are here
sv: Ordlistorna finns här

source: Vocabularies can be used to link resources to existing concepts
sv: Ordlistorna kan användas för att definiera informationsmodeller genom att länka och återanvända termer och definitioner

source: Vocabulary
sv: Ordlista

source: You can add new attribute or association to the Class from here
sv: Här kan lägga till nya attribut för klassen. Attributens värdeområde bygger på datatypen eller associationen, vilken man hänvisar till en annan klass

source: Copy shape
sv: Kopiera den preciserade klassen

source: not found in the concept database
sv: finns inte i ordlistan

source: Define concept for the new class
sv: Definiera ett begrepp för den nya klassen

source: Define concept for the shape
sv: Definiera ett begrepp för den preciserade klassen

source: Define concept for the new shape
sv: Definiera ett begrepp för den nya preciserade klassen

source: Define concept for the attribute
sv: Definiera ett begrepp för attributet

source: Define concept for the new attribute
sv: Definiera ett begrepp för det nya attributet

source: Define concept for the association
sv: Definiera ett begrepp för associationen

source: Define concept for the new association
sv: Definiera ett begrepp för den nya associationen

source: Create new class without referencing concept
sv: Skapa en ny klass utan en begreppsreferens

source: Create new shape without referencing concept
sv: Skapa en ny preciserad klass utan en begreppsreferens

source: Create new association without referencing concept
sv: Skapa en ny association utan en begreppsreferens

source: Create new attribute without referencing concept
sv: Skapa ett nytt attribut utan en begreppsreferens

source: suggest
sv: föreslå

source: suggestion
sv: förslag

source: and create new
sv: och skapa ny

source: Use
sv: Använd

source: Unstable
sv: Halvfärdig

source: Draft
sv: Utkast

source: Recommendation
sv: Rekommendation

source: Deprecated
sv: Ur bruk

source: Suggestion
sv: Förslag

source: Hide
sv: Dölj

source: Show model details
sv: Visa uppgifterna för informationsmodellen

source: Hide model details
sv: Dölj uppgifterna för informationsmodellen

source: Front page
sv: Startsida

source: New library creation
sv: Skapa ett nytt datakomponetbibliotek

source: New profile creation
sv: Skapa en ny tillämpningsprofil

source: Delete library
sv: Ta bort datakomponetbiblioteket

source: Delete profile
sv: Ta bort tillämpningsprofilen

source: group
sv: Grupp

source: model
sv: Datakomponetbibliotek

source: library
sv: Datakomponetbibliotek

source: shape
sv: Preciserad klass

source: profile
sv: Tillämpningsprofil

source: class
sv: Klass

source: attribute
sv: Attribut

source: property
sv: Egenskap

source: fi
sv: På finska

source: en
sv: På engelska

source: data language
sv: Innehållets språk

source: data fi
sv: Innehåll på finska

source: data en
sv: Innehåll på engelska

source: data sv
sv: Innehåll på svenska

source: data ru
sv: Innehåll på ryska

source: Edit in progress
sv: Redigeringen är halvfärdig

source: Are you sure that you want to continue? By continuing unsaved changes will be lost.
sv: Är du säker på att du vill fortsätta? Om du fortsätter förlorar du de ändringar som inte sparats.

source: Dialog is open
sv: Dialogrutan är öppen

source: Are you sure that you want to close dialog?
sv: Är du säker att du vill stänga dialogrutan?

source: Save visualization position
sv: Spara visualiseringens lägen

source: Are you sure you want to save? Saving overrides previously saves positions.
sv: Är du säker att du vill spara? Om du sparar ersätt de tidigare lägena.

source: Delete class
sv: Ta bort klassen

source: Delete shape
sv: Ta bort den preciserade klassen

source: Delete class from this library
sv: Ta bort klassen från detta bibliotek

source: Delete shape from this library
sv: Ta bort den preciserade klassen från detta bibliotek

source: Class list
sv: Klasser

source: Add attribute
sv: Lägg ett attribut

source: Delete attribute
sv: Ta bort attributet

source: Delete attribute from this library
sv: Ta bort attributet från detta bibliotek

source: Delete attribute from this profile
sv: Ta bort attributet från denna profil

source: Attribute list
sv: Attribut

source: Add association
sv: Lägg till en association

source: Delete association
sv: Ta bort associationen

source: Delete association from this library
sv: Ta bort associationen från detta bibliotek

source: Delete association from this profile
sv: Ta bort associationen från denna profil

source: Association list
sv: Associationer

source: Choose attribute
sv: Välj attribut

source: Choose association
sv: Välj association

source: What is description?
sv: Vad är interoperabilitetsbeskrivningar?

source: What is description content
sv: Interoperabilitetsbeskrivningar är datadefinitioner, med hjälp av vilka man säkerställer såväl den människoläsbara som den maskinläsbara semantiska interoperabiliteten samt den tekniska interoperabiliteten som datasystemen kräver i elektroniska, dataintensiva serviceprocesser. Interoperabilitetsbeskrivningarna bildas av begrepp som beskrivs i ordlistorna, gemensamma datadefinitioner vars semantik bygger på dessa begrepp, det vill säga datakomponenter samt tillämpningsprofiler som vidare preciserar deras användning i olika tillämpningar.

source: What is method?
sv: Vad är interoperabilitetsmetoden?

source: What is method content
sv: Med hjälp av interoperabilitetsmetoden kan man beskriva informerande innehåll som används i datasystemen utan att ta ställning till applikationernas tekniska genomförande. Interoperabilitetsmetoden kombinerar utvecklandet av datamodeller, ordlistor och kodsystem till en enhetlig helhet. Metoden bygger på tillämpning av de internationella standarderna. Du kan läsa om interoperabilitetsmetoden och utvecklingen av verktygen här <a href='https://confluence.csc.fi/pages/viewpage.action?pageId=51893708'>.</a>

source: What can I do?
sv: Vad kan man göra med interoperabilitetsverktygen?

source: What can I do content
sv: Interoperabilitetsplattformen är ett verktyg, med hjälp av vilket man kan konkret använda definitioner för dataarkitekturen i den operativa verksamheten. Med datasystemet kan man utveckla, dokumentera och öppet publicera datakomponenter för sam- och återanvändning samt datadefinitioner för specifika genomföranden (tillämpningsprofiler). Datadefinitioner som publiceras via plattformen kan användas för kommunikation (gränssnittslösningar), som databasstrukturer (datalager) eller för applikationsutveckling (informationssystem).

source: How?
sv: Hur kan jag delta?

source: How content
sv: Du kan fritt söka datadefinitioner som publiceras via plattformen. Sakkunniga inom olika områden producerar innehållet i datakomponentbiblioteken.

source: of group
sv: från grupp

source: of model
sv: från datakomponetbibliotek

source: of library
sv: från bibliotek

source: of profile
sv: från tillämpningsprofil

source: of class
sv: från klass

source: of shape
sv: från preciserad klass

source: of association
sv: från association

source: of attribute
sv: från attribut

source: of concept
sv: från begrepp

source: of conceptSuggestion
sv: från begreppsförslag

source: search attribute or association
sv: Hämta ett attribut eller en association

source: search class
sv: Skriv klassens namn

source: search descriptions
sv: Sök i interoperabilitetsbeskrivningar

source: Search from concept database
sv: Hämta från ordlista...

source: search namespace
sv: Hämta namnrymd...

source: search vocabulary
sv: Hämta ordlista...

source: search reference data
sv: Hämta kodsystem...

source: Select attribute
sv: Välj attribut

source: search attribute
sv: Skriv attributets namn

source: Select association
sv: Välj association

source: search association
sv: Skriv associationens namn

source: Use attribute
sv: Använd attribut

source: Use association
sv: Använd association

source: Create and use attribute
sv: Skapa ett attribut och använd

source: Create and use association
sv: Skapa en association och använd

source: Unauthorized
sv: Inga rättigheter

source: ID is already in use
sv: Identifikationsuppgiften är redan i bruk

source: Resource dependencies restricts removing
sv: Resursens beroenden förhindrar borttagningen

source: Unexpected error
sv: Det skedde ett oväntat fel

source: Not found
sv: Kan inte hittas

source: Not removed
sv: Kunde inte tas bort

source: Resource status restricts removing
sv: Kan inte tas bort

source: Resource is in use
sv: Är redan i bruk

source: Already added
sv: Har redan lagts till

source: Write identifier
sv: Skriv identifikationsuppgift...

source: Write URI
sv: Skriv URI...

source: Write URL
sv: Skriv URL...

source: Library information
sv: Uppgifter om datakomponentbiblioteket

source: Profile information
sv: Uppgifter om tillämpningsprofilen

source: Class information
sv: Uppgifter om klassen

source: Shape information
sv: Uppgifter om den preciserade klassen

source: Attribute information
sv: Uppgifter om attributet

source: Association information
sv: Uppgifter om associationen

source: Property information
sv: Uppgifter om egenskapen

source: Concept suggestion information
sv: Uppgifter om begreppsförslaget

source: Class properties
sv: Klassens attribut och associationer

source: Shape properties
sv: Den preciserade klassens attribut och associationer

source: Show excluded
sv: Visa även dem som inte kan läggas till

source: Concept
sv: Begrepp

source: Concept suggestion
sv: Begreppsförslag

source: application/ld+json
sv: JSON-LD

source: text/turtle
sv: Turtle

source: application/xml
sv: XML

source: application/rdf+xml
sv: RDF

source: application/ld+json+context
sv: JSON-LD Context

source: application/schema+json
sv: JSON Schema

source: application/vnd+oai+openapi+json
sv: Open API 3.0.2

source: framed ld+json
sv: Framed JSON-LD

source: ld+json frame
sv: JSON-LD Frame

source: date format
sv: DD.MM.YYYY HH:mm

source: User login
sv: Användarnamn

source: User name
sv: Namn

source: Created at
sv: Skapad

source: Modified at
sv: Redigerad

source: Member groups
sv: Användare i grupper

source: Admin groups
sv: Huvudanvändare i grupper

source: Add properties from class
sv: Lägg till egenskaper från en klass

source: Add properties from super class
sv: Lägg till egenskaper från en överordnad klass

source: Add properties from scope class
sv: Lägg till egenskaper från en preciserad klass

source: Add properties from profile class
sv: Lägg till egenskaper i en klass som flyttas upp

source: Add properties from external class
sv: Lägg till egenskaper från en extern klass

source: Do you want to add following properties from class?
sv: Vill du lägga till följande egenskaper från en klass?

source: Do you want to add following properties from super class?
sv: Vill du lägga till följande egenskaper från en överordnad klass?

source: Do you want to add following properties from scope class?
sv: Vill du lägga till följande egenskaper från en preciserad klass?

source: Do you want to add following properties from profile class?
sv: Vill du lägga till följande egenskaper i en klass som flyttas upp?

source: Do you want to add following properties from external class?
sv: Vill du lägga till följande egenskaper från en extern klass?

source: Not imported by model
sv: Inga namnrymder har lagts till

source: Cannot import profile
sv: Tillämpningsprofilen kan inte användas som namnrymd

source: Shapes are not allowed
sv: Preciserade klasser får inte väljas

source: Classes are not allowed
sv: Det går inte att välja icke-specialiserade klasser

source: Non specialized classes are not allowed
sv: Det går inte att välja icke-specialiserade klasser

source: Use class
sv: Använd klassen

source: Specialize class
sv: Precisera klassen

source: Define concept for the class
sv: Definiera ett begrepp för klassen

source: Can be selected only from this library
sv: Välj bland klasserna i datakomponentbiblioteket

source: Can be selected only from this profile
sv: Välj bland klasserna i tillämpningsprofilen

source: Subject
sv: Begrepp

source: to vocabulary
sv: i ordlistan

source: Create new class
sv: Skapa en ny klass

source: Create new shape
sv: Skapa en ny preciserad klass

source: Create new predicate
sv: Skapa en ny egenskap

source: Create new attribute
sv: Lägg till ett nytt attribut

source: Create new association
sv: Lägg till en ny association

source: New attribute
sv: Nytt attribut

source: New association
sv: Ny association

source: Copy attribute
sv: Kopiera attribut

source: Copy association
sv: Kopiera association

source: Create sub attribute
sv: Skapa underordnat attribut

source: Create sub association
sv: Skapa underordnat association

source: Create super attribute
sv: Skapa överordnat attribut

source: Create super association
sv: Skapa överordnad association

source: Show class information
sv: Visa klassens uppgifter

source: Show attribute information
sv: Visa attributets uppgifter

source: Show association information
sv: Visa associationens uppgifter

source: by referencing external uri
sv: genom att hänvisa till en extern identifikationsuppgift

source: Self reference not allowed
sv: En referens kan inte hänvisa till sig själv

source: Invalid ID
sv: Felaktig identifikationsuppgift

source: External class not found
sv: Det går inte att hitta extern klass

source: External predicate not found
sv: Det går inte att hitta egenskapen

source: External predicate is of wrong type
sv: Fel typ av extern egenskap

source: Input
sv: Skriv

source: Assigned to this profile
sv: Till denna profil kopplade

source: Assigned to this library
sv: Till detta bibliotek kopplade

source: language code
sv: språkkod

source: Internal vocabulary
sv: Internt begreppsurval

source: Edit namespace
sv: Redigera namnrymd

source: Vocabularies
sv: Ordlistor

source: Vocabulary name
sv: Ordlistans namn

source: Edit link
sv: Redigera länk

source: Reference data name
sv: Kodlistans namn

source: Reference data status
sv: Kodlistans status

source: Create new reference data
sv: Skapa ny kodlista

source: Choose reference data
sv: Välj kodlista

source: Write reference data code
sv: Skriv kod...

source: Browse concepts
sv: Bläddra i begrepp

source: Search concept
sv: Välj begrepp

source: Delete concept
sv: Ta bort begrepp

source: Delete concept from this library
sv: Ta bort begreppet från detta bibliotek

source: Delete concept from this profile
sv: Ta bort begreppet från denna profil

source: Delete conceptSuggestion
sv: Ta bort begreppsförslag

source: Delete conceptSuggestion from this library
sv: Ta bort begreppsförslaget från detta bibliotek

source: Delete conceptSuggestion from this profile
sv: Ta bort begreppsförslaget från denna profil

source: URI stem
sv: URI-format

source: Interoperability method description
sv: Med hjälp av metoden säkerställer man att tillämpningen av gemensamma definitioner är systematisk och bibehåller semantiken i olika genomföranden, och kan således förstås av olika aktörer.

source: Label
sv: Namn

source: Local ID
sv: Lokalt ID

source: Allowed languages
sv: Tillåtna språk

source: In language
sv: På finska

source: Undefined
sv: Ingen definition

source: Assign reusable predicate to library
sv: Lägg till en referens i biblioteket

source: Assign reusable predicate to profile
sv: Lägg till en referens i tillämpningsprofilen

source: Assign class to library
sv: Lägg till en klass i biblioteket

source: Specialize class to profile
sv: Precisera klassen i tillämpningsprofilen

source: Copy reusable association to library
sv: Kopiera associationen till biblioteket

source: Copy reusable association to profile
sv: Kopiera associationen till tillämpningsprofilen

source: Copy reusable attribute to library
sv: Kopiera attributet till biblioteket

source: Copy reusable attribute to profile
sv: Kopiera attributet till tillämpningsprofilen

source: Defined in vocabularies
sv: Har definierats i ordlistor

source: Change concept
sv: Byt begrepp

source: Choose concept
sv: Välj begrepp

source: Submit error
sv: Det skedde ett fel i funktionen

source: Predicate in use
sv: Predikatet är redan i bruk

source: Predicate type cannot be changed because it is already used by following resources
sv: Typen av predikat kan inte ändras, eftersom följande resurser använder det

source: Convert to association
sv: Ändra till association

source: Convert to attribute
sv: Ändra till attribut

source: Copy "{{text}}" to clipboard
sv: Kopiera “{{text}}” till urklipp

source: Copy properties
sv: Kopiera egenskaper

source: Copy properties from class
sv: Kopiera attribut eller associationer från klassen

source: Session expired
sv: Sessionen har gått ut

source: Model not found
sv: Modellen kan inte hittas

source: Group not found
sv: Gruppen kan inte hittas

source: Page not found
sv: Sidan kan inte hittas

source: Resource not found
sv: Resursen kan inte hittas

source: You will be redirected to the front page
sv: Du omdirigeras till starsidan

source: You will be redirected to the model
sv: Du omdirigeras till modellens sida

source: Please login to perform the action
sv: Vänligen logga in för att slutföra funktionen

source: Duplicate association target
sv: Objektet för associationen har redan lagts till

source: No
sv: Nej

source: Match to content
sv: Hämta från innehåll

source: Unique label
sv: Ett värde per språk

source: All organizations
sv: Alla organisationer

source: Choose organization
sv: Välj organisation

source: ADMIN
sv: Administratör

source: DATA_MODEL_EDITOR
sv: Datamodellerare

source: TERMINOLOGY_EDITOR
sv: Terminologiredigerare

source: CODE_LIST_EDITOR
sv: Kodlistredigerare

source: MEMBER
sv: Medlem

source: Add new library
sv: Lägg till ny informationsområdesspecifik informationsmodell

source: Add new profile
sv: Lägg till ny tillämpningsspecifik informationsmodell

source: InformationPool
sv: Datalager

source: InformationSystem
sv: Informationssystem

source: ExchangeFormat
sv: Överföringsformat

source: InformationDescription
sv: Informerande innehåll

source: Search
sv: Sök

source: standard
sv: Internationell rekommendation

source: All model types
sv: Alla typer av informationsmodeller

source: All use contexts
sv: Alla typer av innehåll

source: Model
sv: Informationsmodell

source: Deep class hit
sv: Klasser

source: Deep shape hit
sv: Preciserade klasser

source: Deep attribute hit
sv: Attribut

source: Deep association hit
sv: Associationer

source: Concept status
sv: Begreppets status

source: Concept modified at
sv: Begreppet har redigerats

source: ADD EMAIL SUBSCRIPTION TO RESOURCE REGARDING CHANGES?
sv: BESTÄLL E-POSTAVISERINGAR OM ÄNDRINGAR I MATERIALET?

source: REMOVE EMAIL SUBSCRIPTION TO RESOURCE?
sv: TA BORT E-POSTBESTÄLLNINGEN OM MATERIALET?

source: ARE YOU SURE YOU WANT TO ENABLE THE NOTIFICATION EMAIL SUBSCRIPTION?
sv: ÄR DU SÄKER ATT DU VILL AKTIVERA INSTÄLLNINGEN FÖR ATT TA EMOT E-POST?

source: ARE YOU SURE YOU WANT TO DISABLE THE NOTIFICATION EMAIL SUBSCRIPTION?
sv: ÄR DU SÄKER ATT DU VILL INAKTIVERA INSTÄLLNINGEN FÖR ATT TA EMOT E-POST?

source: Adding subscription failed.
sv: Det gick inte att beställa aviseringar.

source: Subscription deletion failed.
sv: Borttagning av aviseringar misslyckades.

source: INFO_TEXT_EMAIL_SUBSCRIPTIONS
sv: Med denna funktion väljer du att aktivera/inaktivera aviseringsfunktionen. Genom att ta bort krysset för ”Dagligen” kan du inaktivera alla aviseringar på en gång. Genom att kryssa för på nytt aktiveras aviseringar.

source: CHANGE STATUS?
sv: ÄNDRA STATUS?

source: CHANGE_STATUS_CONFIRMATION_PARAGRAPH_1
sv: Är du säker att du vill ändra status?

source: CHANGE_STATUS_CONFIRMATION_PARAGRAPH_2
sv: Efter att du sparat kan du inte längre ändra status till Halvfärdig eller Utkast.

source: Choose starting status
sv: Välj utgångsläge

source: Choose target status
sv: Välj målläge

source: UPDATING_STATUSES_MESSAGE
sv: Förändringen av statusar i informationsmodellets resurser pågår.

source: Change resource statuses at the same time?
sv: Ändra samtidigt status för resurser?

source: CHANGE RESOURCE STATUSES TOO?
sv: Ska även alla resurser med status {{startStatus}} ändras till status {{endStatus}}?

source: CREATING_NEW_MODEL_VERSION_MESSAGE
sv: Skapande av ny version pågår

source: Example info
sv: Exempelvärde för egenskapen

source: Editorial note
sv: Redigerarens kommentar

source: Class id
sv: Klassens identifikationsuppgift

source: Class id info
sv: Klassens individualiserande curie-identifikationsuppgift

source: Shape id
sv: Den preciserade klassens identifikationsuppgift

source: Shape id info
sv: Den preciserade klassens identifikationsuppgift

source: Attribute id
sv: Attributets identifikationsuppgift

source: Attribute id info
sv: Attributets individualiserande curie-identifikationsuppgift

source: Association id
sv: Associationens identifikationsuppgift

source: Association id info
sv: Associationens individualiserande curie-identifikationsuppgift

source: Property id
sv: Egenskapens identifikationsuppgift

source: Property id info
sv: Egenskapens individualiserande identifikationsuppgift

source: Class property id
sv: Lokal identifikationsuppgift för klassens egenskap

source: Class property id info
sv: Sekundär identifikationsuppgift för klassens egenskap som kan användas i ett schema eller andra lokala genomföranden

source: Class attribute id
sv: Lokal identifikationsuppgift för klassens attribut
