Repository: VRK-YTI/yti-datamodel-ui
Catalog: po/*.po
Languages: sv

source: Copied
sv: Kopierat

source: Yes
sv: Ja

source: Cancel
sv: Ångra

source: Select help topic
sv: Välj anvisningens ämne

source: Close
sv: Stäng

source: Show history
sv: Visa historik

source: Copy
sv: Kopiera

source: Imported namespaces
sv: Namnrymder som använts

source: Defined by this model
sv: Definierade i denna informationsmodell

source: All models
sv: Alla informationsmodeller

source: Show classes defined in profiles
sv: Visa de klasser som definierats i profilerna

source: All types
sv: Alla typer

source: Required
sv: Obligatoriskt fält

source: Remove
sv: Ta bort

source: Edit
sv: Redigera

source: None added
sv: Inget har lagts till

source: Use context
sv: Typ av innehåll

source: Classifications
sv: Informationsområden

source: Add classification
sv: Lägg till informationsområde

source: Contributors
sv: Innehållsproducenter

source: Add contributor
sv: Lägg till innehållsproducent

source: Import namespace
sv: Lägg till namnrymd

source: Links
sv: Länkar

source: Add link
sv: Lägg till länk

source: Status changed to one resource.
sv: Status har ändrats för en resurs.

source: Status changed to
sv: Status har ändrats för

source: resources.
sv: resursen.

source: No resources were found with the starting status. No changes to resources statuses.
sv: Status har inte ändrats för en enda resurs. Det gick inte att hitta utbytbara resurser.

source: New version of datamodel is created
sv: Ny version av informationsmodellet skapat

source: Create new version of datamodel
sv: Skapa ny version av informationsmodellet

source: Define prefix for the new version. Note that prefix is used to define the new namespace.
sv: Definiera prefix för den nya versionen. Prefix är en del av namnrymd det nya informationsmodellet.

source: Save
sv: Spara

source: Reference data
sv: Kodsystem

source: Add reference data
sv: Lägg till kodsystem

source: Technical namespaces
sv: Tekniska namnrymder

source: Reference data information
sv: Uppgifter om kodlistan

source: Update codes
sv: Uppdatera koder

source: Terminologies
sv: Ordlistor som används

source: Add vocabulary
sv: Lägg till ordlista

source: Maximize
sv: Förstora

source: Minimize
sv: Förminska

source: previous
sv: föregående

source: next
sv: nästa

source: close
sv: stäng

source: Data Vocabularies
sv: Informationsmodeller

source: Confirm delete
sv: Godkännande av borttagning

source: Following items are depending on the deleted
sv: Följande påverkas av borttagningen

source: Are you sure that you want to delete?
sv: Är du säker att du vill ta bort?

source: Show
sv: Visa

source: Download
sv: spara

source: Export
sv: Exportera

source: Historical versions
sv: Historiska versioner

source: Choose action
sv: Välj funktion

source: Add email subscription
sv: Beställ e-postaviseringar

source: Remove email subscription
sv: Ta bort e-postaviseringar

source: Update datamodel's resources' statuses
sv: Ändra status till informationsmodellets resurser

source: Create new version
sv: Skapa ny version

source: No referrers
sv: Inga referenser

source: Usage
sv: Referenser från andra komponenter

source: Select all
sv: Välj alla

source: Deselect all
sv: Ta bort alla val

source: Define type for class property
sv: Definiera typen av egenskap för klassen

source: Choose
sv: Välj

source: Add property
sv: Lägg till ett attribut eller en association

source: No properties yet
sv: Inga egenskaper ännu

source: Additional information
sv: Mer information

source: Logical constraints
sv: Logiska begränsningar

source: Choose class
sv: Välj klass

source: Not defined
sv: Ingen definition

source: Reusable predicate information
sv: Uppgifter om en återanvändbar egenskap

source: Change reusable predicate
sv: Byt återanvändbar egenskap

source: Predicate information not found
sv: Det gick inte att hitta någon återanvändbar egenskap

source: Optional metadata
sv: Valbara metadata

source: Technical metadata
sv: Tekniska metadata

source: Property pairs
sv: Motsvarigheter till egenskapen

source: Reusable predicate
sv: Återanvändbar egenskap

source: Select class
sv: Välj klass

source: Add class
sv: Lägg till klass

source: External classes
sv: Externa klasser

source: Include:
sv: Visa även:

source: All information domains
sv: Alla informationsområden

source: All class types
sv: Alla klasstyper

source: All statuses
sv: Alla statusar

source: Create shape from external URI
sv: Skapa klass från en extern URI-kod

source: Search existing class
sv: Hämta befintlig klass

source: New class
sv: Ny klass

source: Shape from URI
sv: Precisera utifrån URI-koden

source: Actions
sv: Funktioner

source: Copy class
sv: Kopiera klass

source: Create sub class
sv: Skapa underordnad klass

source: Create super class
sv: Skapa överordnad klass

source: Add namespace to model
sv: Lägg till en informationsmodell som ett beroende

source: All vocabularies
sv: Alla ordlistor

source: Concept is suggested to vocabulary
sv: Begreppet har föreslagits till ordlistan

source: Select attribute or association
sv: Välj ett attribut eller en association

source: Add attribute or association
sv: Lägg till ett attribut eller en association

source: INFO_TEXT_SUBJECT_VIEW_SELECT_CONCEPT
sv: Välj ett begrepp ur ordlistan

source: Select concept
sv: Välj begrepp

source: No concept defined
sv: Begreppet har inte definierats

source: Invalid url error
sv: Inmatningen är inte en URL

source: Invalid stem error
sv: Felaktig URI-format

source: Invalid namespace error
sv: Namnrymden måste sluta med tecknet ”#” eller ”/”

source: Invalid namespace url urn error
sv: Namnrymden ska vara en URL och sluta med tecknet ”#” eller ”/” eller vara i URN-format

source: Invalid id error
sv: Felaktig identifikationsuppgift

source: Existing id error
sv: Identifikationsuppgiften är redan i bruk

source: Existing or reserved id error
sv: Identifikationsuppgiften är redan i bruk eller reserverad

source: Required error
sv: Obligatoriskt fält

source: Required localized error
sv: Måste definieras på minst ett språk

source: Duplicate error
sv: Inmatningen har redan lagts till

source: String error
sv: Litteralen måste börja med en bokstav

source: Length error
sv: Inmatningen är för lång

source: Prefix error
sv: Prefixet ska börja med liten bokstav. Den får endast innehålla små bokstäver, siffror samt skiljetecknen ”-” och ”_”. Bokstäverna å, ä, ö är inte tillåtna.

source: Negative error
sv: Får inte vara negativ

source: Greater than max error
sv: Får inte vara större än maxvärdet

source: Less than min error
sv: Får inte var mindre än minimivärdet

source: Unknown namespace
sv: Okänd namnrymd

source: Id name is required
sv: Koden saknas i namnrymden

source: Must be imported namespace
sv: Ingen namnrymd har lagts till som ett beroende

source: Is not valid language code
sv: Okänd språkkod

source: Is not valid reference data code
sv: Okänt värde för kodlistan

source: INFO_TEXT_FRONTPAGE_SEARCH
sv: Sökningen omfattar enligt standardinställningen informationsmodellernas namn. Du kan även söka i innehåll med hjälp av funktionen ”Sök även i”.

source: Search term
sv: Sökord

source: INFO_TEXT_FRONTPAGE_FILTER_W_CLASSIFICATION
sv: Alla informationsmodeller är kategoriserade i ett informationsområde. Genom att klicka på informationsområdet kan du filtrera sökresultaten att endast visa informationsmodeller som ingår i ett visst informationsområde. Du tar bort valet genom att klicka på informationsområdet på nytt.

source: INFO_TEXT_FRONTPAGE_FILTER_RESULTS
sv: Du kan filtrera sökresultaten enligt organisation, typ eller status. Med organisation avses den organisation som producerar innehållet i och ansvarar för uppdateringen av informationsmodellen. Typ avser typen av informationsmodell som kan vara ett datakomponentsbibliotek eller en tillämpningsprofil. Status avser status för informationsmodellens administration.

source: Total results
sv: Träffar totalt

source: Add model
sv: Lägg till en informationsmodell

source: ADD_LIBRARY_BUTTON_TEXT
sv: Lägg till ett datakomponentsbibliotek

source: ADD_PROFILE_BUTTON_TEXT
sv: Lägg till en tillämpningsprofil

source: ToolInfo
sv: Verktyget Informationsmodeller är ett verktyg för datamodellerare och informationsarkitekter på organisationer inom den offentliga förvaltningen. Verktyget används för att beskriva datasystemens och gränsytornas informerande innehåll och datastrukturer. Verktyget Informationsmodeller gör den logiska datamodelleringen av offentliga data inom den offentliga förvaltningen öppen och offentlig, vilket underlättar användningen av informationsmodeller över organisationsgränserna.

source: Search model
sv: Hämta informationsmodell

source: Extend search
sv: Sök även i

source: to content
sv: innehåll

source: Filter with information domain
sv: Avgränsa enligt informationsområde

source: Filter results
sv: Avgränsa sökresultaten

source: result
sv: sökresultat

source: results
sv: sökresultat

source: Search results
sv: Sökresultat

source: Maintenance content
sv: Tyvärr är systemet för närvarande ur bruk på grund av ett serviceavbrott

source: Maintenance
sv: Serviceavbrott

source: Concept information
sv: Uppgifter om begreppet

source: Not selected
sv: Inget valt

source: Choose root class
sv: Välj rotnod

source: Clear selection
sv: ta bort val

source: Edit reference data
sv: Redigera kodlistan

source: Resources:
sv: Resurser:

source: Enforce status transition rules
sv: Använd valideringsreglerna för statusövergångar.

source: Starting status
sv: Utgångsläge

source: Target status
sv: Målläge

source: Change resource statuses as well
sv: Byt samtidigt status för resurserna

source: Please note that the content of this field is public. Don't use personal contact information!
sv: Observera att innehållet i detta fält är offentligt. Använd inte personliga kontaktuppgifter!

source: You will receive an email notification when this resource changes.
sv: Du meddelas per e-post när det görs ändringar i detta material.

source: Datamodel definition
sv: Datadefinitioner

source: Datamodel details
sv: Uppgifter om informationsmodellen

source: Datamodel documentation
sv: Dokumentation om informationsmodellen

source: Information domain
sv: Informationsområde

source: Organization
sv: Organisation

source: Browse reference data codes
sv: Bläddra i kodlistan

source: Identifier
sv: Identifikationsuppgift

source: Title
sv: Namn

source: Select domain
sv: Välj informationsområde

source: Show technical namespaces
sv: Visa tekniska namnrymder

source: Add new namespace
sv: Skapa ny namnrymd

source: Search namespaces
sv: Hämta namnrymder

source: Select organization
sv: Välj organisation

source: Search reference data
sv: Hämta kodlistor

source: All servers
sv: Alla servrar

source: All groups
sv: Alla grupper

source: Create new
sv: Skapa ny

source: Use selection
sv: Använd valet

source: Search vocabularies
sv: Hämta ordlistor

source: No search results
sv: Inga sökresultat

source: Start help
sv: Starta anvisning

source: Impersonate user
sv: Agera som användare

source: LOG IN
sv: LOGGA IN

source: LOG OUT
sv: LOGGA UT

source: User details
sv: Användaruppgifter

source: Suomi.fi Terminologies
sv: Suomi.fi-ordlistor

source: Suomi.fi Reference Data
sv: Suomi.fi-kodlistor

source: Suomi.fi Comments
sv: Suomi.fi-kommentarer

source: User right management
sv: Administrering av behörigheter

source: Name
sv: Namn

source: Email
sv: E-post

source: Organizations and roles
sv: Organisationer och roller

source: Unknown organization
sv: Okänd organisation

source: Waiting for approval
sv: Väntar på godkännande

source: Send access request
sv: Skicka begäran om behörighet

source: Send
sv: Sänd

source: You have subscribed to be notified via email when the following resources change. To remove the subscription, click the icon next to the resource.
sv: Du har beställt e-postaviseringar om ändringar i följande material. För att ta bort aviseringen, klicka på ikonen bredvid materialet.

source: Email notifications
sv: E-postaviseringar

source: Daily
sv: Dagligen

source: Code list resources
sv: Material som hänför sig kodlistor

source: Terminology resources
sv: Material som hänför sig till ordlistor

source: Datamodel resources
sv: Material som hänför sig till informationsmodeller

source: Comments resources
sv: Material som hänför sig till kommentarer

source: INFORMATION
sv: UPPGIFTER

source: SUBSCRIPTIONS
sv: BESTÄLLNINGAR

source: xsd:long error
sv: Fel heltal

source: xsd:string
sv: Text

source: rdfs:Literal
sv: Litteral

source: rdfs:Literal error
sv: Fel litteral

source: rdf:langString
sv: Texten har språkversioner

source: rdf:langString error
sv: Fel text i språkversionerna

source: xsd:anyURI
sv: URI

source: xsd:anyURI error
sv: Fel URI

source: xsd:boolean
sv: Koppling

source: xsd:boolean error
sv: Fel koppling

source: xsd:decimal
sv: Decimal

source: xsd:decimal error
sv: Fel decimal

source: xsd:double
sv: Decimal (64bit)

source: xsd:double error
sv: Fel decimal

source: xsd:float
sv: Decimal (32bit)

source: xsd:float error
sv: Fel decimal

source: xsd:integer
sv: Heltal

source: xsd:integer error
sv: Fel heltal

source: xsd:long
sv: Heltal (64bit)

source: xsd:string error
sv: Fel text

source: xsd:int
sv: Heltal (32bit)

source: xsd:int error
sv: Fel heltal

source: xsd:date
sv: Datum

source: xsd:date error
sv: Fel datum

source: xsd:dateTime
sv: Tidpunkt

source: xsd:dateTime error
sv: Fel tidpunkt

source: xsd:time
sv: Tid

source: xsd:time error
sv: Fel tid

source: xsd:gYear
sv: År

source: xsd:gYear error
sv: Fel år

source: xsd:gMonth
sv: Månad

source: xsd:gMonth error
sv: Fel månad

source: xsd:gDay
sv: Datum

source: xsd:gDay error
sv: Fel datum

source: xsd:hexBinary
sv: Hex binär

source: xsd:hexBinary error
sv: Fel hex binär

source: xsd:base64Binary
sv: Base64 binär

source: xsd:base64Binary error
sv: Fel Base64 binär

source: Guide through specializing a class
sv: Anvisning för specialisering av klass

source: Add classification info
sv: Informationsområdena kategoriserar informationsmodellerna enligt olika förvaltningsområden.

source: Add contributor info
sv: Organisationen som producerar innehållet ansvarar för uppdateringen av informationsmodellen. Alla datamodellerare i organisationen kan redigera de informationsmodeller som organisationen är innehållsproducent för.

source: Add library
sv: Lägg till en informationsområdesspecifik informationsmodell

source: Add library description
sv: Genom att lägga till ett nytt datakomponentsbibliotek kan du beskriva informerande innehåll som vanligtvis används inom informationsområdet. Då du definierar datakomponenter kan du använda ordlistorna för området i fråga och länka det informerande innehållet till internationella standarder. Klasserna i datakomponentbiblioteket är återanvändbara strukturer som kan användas för att definiera tillämpningsspecifikt informerande innehåll i tillämpningsprofilen.

source: Add model description
sv: Här kan du lägga till en ny domänspecifik informationsmodell eller en tillämpningsspecifik informationsmodell.

source: Add new property
sv: Lägg till ett nytt attribut eller en ny association

source: Add new property description
sv: Attributet och associationen är klassens egenskaper, med vilka du kan närmare definiera klassens innehåll och förhållande till andra klasser.

source: Add profile
sv: Lägg till en tillämpningsspecifik informationsmodell

source: Add profile description
sv: Genom att lägga till en ny tillämpningsprofil kan du beskriva ett valfritt informerande innehåll med hjälp av de återanvändbara klasserna som definierats i datakomponentsbiblioteket. Dessutom kan du definiera nya klasser med hjälp av domänspecifika ordlistor.

source: Add reference to namespace
sv: Lägg till referens till namnrymden

source: Add reference to namespace description
sv: Genom att lägga till en ny namnrymd kan du länka klasser eller egenskaper till internationella rekommendationer

source: Add vocabulary description
sv: Genom att lägga till en ordlista till informationsmodellen kan du använda begreppsdefinitioner som används i informationsområdet för att definiera informationsmodeller.

source: Association is here
sv: Uppgifterna om associationen visas här

source: Association label
sv: Associationens namn (label)

source: Association label info
sv: Associationens människoläsbara namn

source: Association target can be changed from the list or by typing the identifier
sv: Objektet för associationen kan ändras här genom att välja ett nytt objekt från listan eller ange klassens identifikationsuppgift i fältet

source: Association target is here
sv: Objektet för associationen visas här

source: Association target must be selected from list of existing classes
sv: Objektet för associationen måste väljas från listan över befintliga klasser

source: Attribute is here
sv: Uppgifterna om attributet visas här

source: Attribute is here info
sv: I attributets uppgifter fastställs en permanent URI-kod, ett namn, en definition och en datatyp

source: Attribute label
sv: Attributets namn (label)

source: Attribute label info
sv: Attributets människoläsbara namn

source: Changes need to be saved
sv: Om du vill spara ändringarna, klicka på Spara

source: Class is here
sv: Uppgifterna om klassen visas här

source: Class is here info
sv: I klassens uppgifter fastställs klassens namn, beskrivning, begrepp som klassen bygger på, samt klassens egenskaper

source: Classes can be modified
sv: Klassen kan redigeras här

source: Classes can be seen visually here
sv: Klasserna och associationerna mellan dessa återges visuellt här

source: Classifications are here
sv: Informationsområdena visas här

source: Concept is here
sv: Begreppet finns här

source: Concept is here info
sv: Begreppets

source: Concept label
sv: Begreppets namn

source: Concept label info
sv: Begreppets rekommenderade namn

source: Confirm selection
sv: Godkänn valet

source: Confirm selection info
sv: Godkänn ändringarna och fortsätt

source: Congratulations for completing adding an association!
sv: Grattis, du har lagt till en association!

source: Congratulations for completing adding an attribute!
sv: Grattis, du har lagt till ett attribut!

source: Congratulations for completing class assignation!
sv: Grattis, du har lagt till en klass i biblioteket!

source: Congratulations for completing library creation!
sv: Grattis, du har skapat ett datakomponentbibliotek!

source: Congratulations for completing library creation! description
sv: Du kan nu fortsätta skapa riktiga datakomponentbibliotek

source: Congratulations for completing namespace require!
sv: Grattis, du har lagt till en namnrymd!

source: Congratulations for completing new class creation!
sv: Grattis, du har lagt till en ny klass!

source: Congratulations for completing profile creation!
sv: Grattis, du har skapat en tillämpningsprofil!

source: Congratulations for completing profile creation! description
sv: Du kan nu fortsätta skapa riktiga tillämpningsprofiler

source: Congratulations for completing specialize class!
sv: Grattis, du har specialiserat en klass!

source: Contributors are here
sv: Innehållsproducenterna visas här

source: Description
sv: Beskrivning

source: Description info
sv: Beskrivning av det informerande innehållet

source: Guide through adding an association
sv: Anvisning för att lägga till association

source: Guide through adding an attribute
sv: Anvisning för att lägga attribut

source: Guide through assigning class to a library
sv: Anvisning för att koppla en klass till biblioteket

source: Guide through creating a class
sv: Anvisning för att skapa en ny klass

source: Guide through creating new library
sv: Anvisning för att skapa en nytt datakomponentbibliotek

source: Guide through creating new library description
sv: Med ett datakomponentbibliotek avses en logisk informationsmodell som definierats enligt domän och i vilken man definierar återanvändbara datastrukturer. Datakomponenterna länkas till internationella och nationella standarder, ordlistor och kodsystem som används inom domänen.

source: Guide through creating new profile
sv: Anvisning för att skapa en ny tillämpningsprofil

source: Guide through creating new profile description
sv: Med en tillämpningsprofil avses en logisk informationsmodell som fastställs för ett visst bruk och som använder återanvändbara datakomponeter som definierats för domänen. Med hjälp av en tillämpningsprofil kan man dokumentera nödvändigt informerande innehåll och datastrukturer.

source: Guide through requiring a namespace
sv: Anvisning för att lägga till en namnrymd

source: Add class description
sv: Du kan lägga till en ny klass här

source: Imported namespaces are here
sv: Namnrymder som lagts till visas här

source: Imported namespaces can be used to link resources to existing standards
sv: Inkluderade namnrymder kan användas för att länka datakomponenter

source: Library label
sv: Datakomponentbibliotekets namn

source: Library label info
sv: Datakomponentbibliotekets människoläsbara namn

source: Model languages
sv: Det informerande innehållets språk

source: Model languages info
sv: Genom att definiera språket kan en informationsmodell lokaliseras för det valda språket. Ett språk definieras genom att de önskade språken klassificeras enligt standarden ISO-639-2

source: Modify class
sv: Redigerar klassen

source: Modify library
sv: Redigerar datakomponentbiblioteket

source: Modify library description
sv: Datakomponentbiblioteket kan redigeras om du vill precisera beskrivningen eller lägga till nya ordlistor, kodlistor eller namnrymder

source: Modify profile
sv: Redigera tillämpningsprofilen

source: Modify profile description
sv: Tillämpningsprofilen kan redigeras om du vill precisera beskrivningen eller lägga till nya ordlistor, kodsystem eller namnrymder

source: Open library details
sv: Öppnar uppgifterna för datakomponentbiblioteket

source: Open library details description
sv: Tilläggsuppgifter om datakomponetbiblioteket, såsom ordlistor och kodsystem som använts finns under denna panel Här kan du även exportera datakomponetbiblioteket i olika format, såsom XML- eller JSON base-schema

source: Open profile details
sv: Öppna uppgifterna för tillämpningsprofilen

source: Open profile details description
sv: Tilläggsuppgifter om tillämpningsprofilen, såsom ordlistor och kodlistor som använts finns under denna panel Här kan du även exportera profilen i olika format såsom XML- eller JSON-scheman.

source: Prefix info
sv: Med prefix avses en kort kod som används för att bilda en permanent URI-kod och namnrymd.

source: Profile label
sv: Tillämpningsprofilens namn

source: Profile label info
sv: Tillämpningsprofilens människoläsbara namn

source: Property is here
sv: Uppgifter om egenskapen visas här

source: Property is here info
sv: Uppgifterna för egenskapen beskriver namnet, definitionen, värdeområdet och begreppet som egenskapen bygger på.

source: Save changes
sv: Spara ändringar

source: Search for
sv: Sök {{name}}

source: Search for class
sv: Sök klass

source: Search for class info
sv: Sök klassens uppgifter

source: Search for concept
sv: Sök begrepp

source: Search for concept info
sv: Hämta begreppet från ordlistan

source: Search for info
sv: Du kan söka innehåll här

source: Search for predicate
sv: Hämta en återanvändbar egenskap

source: Search for predicate info
sv: Hämta det attribut eller den association som du behöver

source: Select association target
sv: Välj objekt för associationen

source: Select class description
sv: Du kan välja klass här

source: Select concept suggest creation
sv: Föreslå ett nytt begrepp i ordlistan

source: Select concept suggest creation info
sv: Föreslå ett begrepp om det befintliga begreppet inte är definierat i de ordlistor som används

source: Select name and description
sv: Välj attributen namn och beskrivning
